In [2]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt
import import_ipynb
from Student_info import country_Student
from Student_info import student_info

importing Jupyter notebook from Student_info.ipynb
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35230 entries, 0 to 35229
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   student_id       35230 non-null  int64
 1   student_country  35217 non-null  object
 2   date_registered  35230 non-null  object
dtypes: int64(1), object(2)
memory usage: 825.8+ KB

In [3]:
student_hub_questions = pd.read_csv('dataSets/365_database/365_student_hub_questions.csv')
# student_hub_questions[student_hub_questions['student_id']==293967]
student_hub_questions['student_id'].value_counts()

274861    57
266001    27
261777    27
284438    27
275129    22
          ..
268613     1
270179     1
282408     1
268331     1
288098     1
Name: student_id, Length: 289, dtype: int64

In [4]:
missing_country_df = student_info[student_info.isnull().any(axis=1)]
missing_country = missing_country_df['student_id'].tolist()
(missing_country)

[261725,
 262665,
 272144,
 278827,
 282654,
 282914,
 283704,
 283791,
 284550,
 284790,
 286959,
 290648,
 293967]

In [5]:
df = student_hub_questions.copy()

df_cleaned = df[~df['student_id'].isin(missing_country)]
student_hub_questions_cleaned = df_cleaned.reset_index(drop=True)
(student_hub_questions_cleaned)

     hub_question_id  student_id date_question_asked
0               7619      258803          2022-01-03
1               7630      258803          2022-01-04
2               7662      259342          2022-01-05
3               7667      259391          2022-01-05
4               7668      259174          2022-01-05
..               ...         ...                 ...
822            10386      287473          2022-10-19
823            10387      287473          2022-10-19
824            10388      291121          2022-10-19
825            10404      274798          2022-10-20
826            10407      288098          2022-10-20

[827 rows x 3 columns]

In [7]:
country = []
i = 0
n = len(student_hub_questions_cleaned)-1

while (i<=n):
    x=student_hub_questions_cleaned['student_id'].loc[i]
    y=country_Student[x]
    country.append(y)
    i=i+1

In [8]:
print(len(country))
df_country = pd.DataFrame(country,columns = ['country'])
df_country

827

    country
0        US
1        US
2        IL
3        BW
4        CA
..      ...
822      EG
823      EG
824      IN
825      GB
826      IN

[827 rows x 1 columns]

In [10]:
frames = [student_hub_questions_cleaned, df_country]

student_hub_country = pd.concat(frames,axis = 1)

# len(student_hub_country['country'].unique())
student_hub_country

     hub_question_id  student_id date_question_asked country
0               7619      258803          2022-01-03      US
1               7630      258803          2022-01-04      US
2               7662      259342          2022-01-05      IL
3               7667      259391          2022-01-05      BW
4               7668      259174          2022-01-05      CA
..               ...         ...                 ...     ...
822            10386      287473          2022-10-19      EG
823            10387      287473          2022-10-19      EG
824            10388      291121          2022-10-19      IN
825            10404      274798          2022-10-20      GB
826            10407      288098          2022-10-20      IN

[827 rows x 4 columns]

In [11]:
student_hub_country['student_id'].value_counts()

274861    57
266001    27
261777    27
284438    27
275129    22
          ..
268613     1
270179     1
282408     1
268331     1
288098     1
Name: student_id, Length: 289, dtype: int64